ServiceProject/ServiceProject/BillServicePortBinding.sendBill.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion"
    xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
    xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:sunat="http://service.gem.factura.comppago.registro.servicio.sunat.gob.pe/"
    xmlns:ns1="http://service.sunat.gob.pe">
 <SOAP-ENV:Header>
	 <wsse:Security>
	 <wsse:UsernameToken>
	 <wsse:Username>20498590587ELBIBAM6</wsse:Username>
	 <wsse:Password>nArputo-</wsse:Password>
	 </wsse:UsernameToken>
	 </wsse:Security>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:sendBill>
    <fileName>20498590587-03-B004-1430.zip</fileName>
	<contentFile></contentFile>
    <partyType></partyType>
   </ns1:sendBill>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
