xsender/resources/templates/get_status_crd.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>{{username}}</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{password}}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <ns2:getStatusCdr xmlns:ns2="http://service.sunat.gob.pe">
            <rucComprobante>{{body.ruc}}</rucComprobante>
            <tipoComprobante>{{body.tipo_comprobante}}</tipoComprobante>
            <serieComprobante>{{body.serie_comprobante}}</serieComprobante>
            <numeroComprobante>{{body.numero_comprobante}}</numeroComprobante>
        </ns2:getStatusCdr>
    </soap:Body>
</soap:Envelope>